[
  {
    "category": "General",
    "name": "Jfresolve",
    "owner": "dennisstorm-hass",
    "guid": "506F18B8-5DAD-4CD3-B9A0-F7ED933E9939",
    "description": "Stream and resolve external media sources directly through Jellyfin.",
    "overview": "Simplify external playback — Jfresolve automatically finds and streams external media from stremio.",
    "imageUrl": "https://raw.githubusercontent.com/dennisstorm-hass/jfresolve/main/jfresolve.png",
    "versions": [
      {
        "version": "1.0.0.27",
        "changelog": "Security and resilience improvements: Enhanced stream error handling with better error messages and appropriate HTTP status codes. Added circuit breaker pattern for TMDB API and Stremio addon calls to prevent cascading failures. Improved partial failure handling - image downloads and quality versions now continue on individual failures. Added comprehensive input sanitization and validation to prevent injection attacks. Implemented authorization checks for stream endpoint while maintaining FFmpeg compatibility. Enhanced URL validation to prevent SSRF attacks with comprehensive IP range blocking. Added SecurityHelper for safe logging of sensitive data. All improvements from IMPROVEMENTS.md items 19-21, 25-28.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.27/jfresolve.zip",
        "checksum": "47a84cef21ee7c0c88fa892f826c23e0",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-03T10:06:50Z"
      },
      {
        "version": "1.0.0.26",
        "changelog": "Fixed 'Additional data' delay when playing movies/series: Populated MediaSourceInfo with subtitle streams from database to prevent Jellyfin from doing additional probing. When subtitle streams exist in database but are missing from MediaSourceInfo, they are now automatically populated before playback starts. This eliminates the long delay when Jellyfin tries to extract subtitle metadata from embedded streams, significantly improving playback start time.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.26/jfresolve.zip",
        "checksum": "219309593915253d5f96a3536a33f21d",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-03T09:12:21Z"
      },
      {
        "version": "1.0.0.25",
        "changelog": "Fixed subtitle preloading to only run for newly added items: Subtitle background probing now only triggers for items that were added within the last 5 minutes, preventing unnecessary probes when viewing existing items. Added probe tracking cache to prevent duplicate probes. Existing items will have subtitles available after first playback as before. This reduces unnecessary background processing when browsing the library.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.25/jfresolve.zip",
        "checksum": "82b2be25560ad2da0ea6d05cd8d2590c",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-03T08:56:25Z"
      },
      {
        "version": "1.0.0.24",
        "changelog": "Preload subtitle information in UI: Added background probing when items are viewed in the Jellyfin interface to preload subtitle information before first playback. Subtitle streams are now available in the UI shortly after viewing an item, without waiting for first playback. Background probe runs asynchronously and doesn't block the UI. GetStaticMediaSources now uses streams from database to ensure subtitle information is immediately available when items are displayed.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/I/jfresolve.zip",
        "checksum": "ee9e6853f259ef166323d6f5ddbb7c5d",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-02T21:46:49Z"
      },
      {
        "version": "1.0.0.23",
        "changelog": "Performance improvements: Pre-extract subtitle information before playback starts to prevent stream restarts when subtitles are changed during playback. Optimized resume performance - added resolved URL caching to skip redirect following on resume, reducing resume time from 30+ seconds to 2-5 seconds. Increased stream metadata cache duration from 10 minutes to 1 hour for better resume performance. Subtitle changes during playback no longer cause stuttering or stream restarts.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.23/jfresolve.zip",
        "checksum": "aa27342457f187c631dc042702bbe66c",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-02T20:01:09Z"
      },
      {
        "version": "1.0.0.22",
        "changelog": "Fixed 15-minute playback timeout: Increased HttpClient timeout from 10 minutes to 4 hours to support long movies/episodes without interruption. Added immediate cancellation support - when client stops playback, the plugin now immediately cancels upstream requests using HttpContext.RequestAborted, ensuring connections close instantly instead of waiting for timeout. Improved connection cleanup and exception handling for client disconnects. Movies over 2 hours now play seamlessly without stopping every 15 minutes.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.22/jfresolve.zip",
        "checksum": "5b6b9e09f1a8e722346e54b39cb947fb",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-02T18:59:10Z"
      },
      {
        "version": "1.0.0.21",
        "changelog": "Fixed pause/resume playback: Implemented workaround for upstream servers that don't support HTTP Range requests. When FFmpeg requests a range (e.g., bytes=1057350-) but the upstream server returns 200 OK with the full file, the plugin now automatically skips the initial bytes and returns 206 Partial Content with proper Content-Range headers to FFmpeg. This allows seamless pause/resume functionality even when the upstream server (Real-Debrid/Stremio) doesn't support range requests. The workaround is transparent to users and doesn't affect normal playback.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.21/jfresolve.zip",
        "checksum": "a883b15586c8601744eb4e96ffb0036d",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-01T13:36:49Z"
      },
      {
        "version": "1.0.0.20",
        "changelog": "Performance optimizations: Optimized TMDB API calls with parallel fetching and caching - IMDB IDs are now fetched in parallel (up to 5 concurrent requests) with a 24-hour cache, reducing search time from 10+ seconds to 2-3 seconds for 10 results. Added stream metadata caching - Stremio addon responses are cached for 10 minutes, reducing redundant API calls when multiple users request the same content. Added folder lookup caching - folder references are cached for 1 hour, eliminating redundant database queries for repeated folder lookups. All caches include automatic cleanup and size limits.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.20/jfresolve.zip",
        "checksum": "cef4b8f648e687cc15f8c1298ee25635",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-01T13:14:34Z"
      },
      {
        "version": "1.0.0.19",
        "changelog": "Fixed ObjectDisposedException on pause/resume: Changed GetStreamsFromAddonAsync to return JsonDocument instead of JsonElement and properly manage its lifecycle. The streams array is now cloned into a new JsonDocument before disposing the original, ensuring the JsonElement remains valid when accessed after pausing and resuming playback. This fixes 'Cannot access a disposed object' errors when resuming playback.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.19/jfresolve.zip",
        "checksum": "47a834a58a4f9bcb53fb772d0ee5d18d",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-01T12:56:45Z"
      },
      {
        "version": "1.0.0.18",
        "changelog": "Fixed warnings and improved logging: Resolved EF Core query warning by adding OrderBy before Skip/Take in search pagination. Changed debug/informational log messages from LogWarning to LogDebug level for folder lookup operations. This reduces log noise and ensures warnings only appear for actual issues.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.18/jfresolve.zip",
        "checksum": "46637dfc3a4807cc54926efaf779ea4f",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-01T12:43:44Z"
      },
      {
        "version": "1.0.0.17",
        "changelog": "Fixed Content-Length mismatch error: Only set Content-Length header for 206 Partial Content responses (range requests) where the range size is known. For full requests (200 OK), don't set Content-Length to allow graceful handling of connection resets without mismatch errors. This fixes 'Response Content-Length mismatch: too few bytes written' errors when clients pause or disconnect during streaming. Also includes code refactoring: extracted stream quality selection to separate service and refactored large methods (ResolveStream, InsertMeta) into smaller, more maintainable functions.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.17/jfresolve.zip",
        "checksum": "26394a928ccdbb866c8896450800b731",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-01T12:37:23Z"
      },
      {
        "version": "1.0.0.16",
        "changelog": "Fixed HTTP 302 redirect handling: Added proper redirect following for stream URLs that return 302 responses (common with Real-Debrid and similar services). The plugin now follows up to 5 redirects while preserving Range headers and validating redirect URLs for security. This fixes streaming errors when addon URLs redirect to the actual stream location.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.16/jfresolve.zip",
        "checksum": "21275da929754bb2f1be526288410462",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-01T12:20:48Z"
      },
      {
        "version": "1.0.0.15",
        "changelog": "Fixed connection reset handling during streaming: Added graceful handling for connection resets when clients pause/disconnect. Prevents 'StatusCode cannot be set because the response has already started' errors. Playback can now resume seamlessly after pauses. Also includes high-priority improvements: extracted magic numbers to constants, fixed memory leaks in failover cache, added input validation and SSRF protection, improved HttpClient configuration with named clients, and added retry logic for TMDB API calls.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.15/jfresolve.zip",
        "checksum": "bf6a4b17ce35d136750762e0d7eadb7a",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-01T12:13:28Z"
      },
      {
        "version": "1.0.0.14",
        "changelog": "Optimized proxy streaming performance: Increased buffer size from 80KB to 256KB and reduced flush frequency to improve throughput and reduce buffering during playback. Flush now occurs every 4 buffers (1MB chunks) instead of every buffer, significantly reducing overhead while maintaining low latency.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.14/jfresolve.zip",
        "checksum": "9a72d1034663b751309b8236d210103d",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-02-01T10:57:04Z"
      },
      {
        "version": "1.0.0.13",
        "changelog": "Fixed plugin image not loading: Added embedded resource for jfresolve.png and created Image endpoint to serve it. Added route handling for both /Plugins/Jfresolve/Image and /Plugins/{guid}/{version}/Image patterns.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.13/jfresolve.zip",
        "checksum": "d9ab313237ab917a0626c0d2bcbfecb5",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-01-29T13:45:00Z"
      },
      {
        "version": "1.0.0.12",
        "changelog": "Fixed Content-Range header handling error: Changed from Contains/GetValues to TryGetValues to properly handle Content-Range header copying without throwing InvalidOperationException. Now checks both response headers and content headers.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.12/jfresolve.zip",
        "checksum": "9eaf12a695fcaae9b073ab2fa3b2b534",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-01-29T13:30:00Z"
      },
      {
        "version": "1.0.0.11",
        "changelog": "Fixed Jellyfin 10.11.6 compatibility: Updated NuGet packages to 10.11.6 and implemented ReattachUserDataAsync with correct signature (BaseItem, CancellationToken). This resolves the interface implementation error.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.11/jfresolve.zip",
        "checksum": "f8a62351dcfed6db9383b87044a2ea19",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-01-29T13:15:00Z"
      },
      {
        "version": "1.0.0.10",
        "changelog": "Fixed Jellyfin 10.11.6 compatibility: Improved ReattachUserDataAsync implementation using reflection with proper BindingFlags to ensure interface contract is satisfied at runtime.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.10/jfresolve.zip",
        "checksum": "37e2a88237cbf33219a7bb4d9f17e248",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-01-29T13:00:00Z"
      },
      {
        "version": "1.0.0.9",
        "changelog": "Fixed Jellyfin 10.11.6 compatibility issue: Added missing ReattachUserDataAsync method implementation to ItemRepositoryDecorator using reflection for interface compatibility.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.9/jfresolve.zip",
        "checksum": "6b89f1e15c011fa7b755bc857cef2e5b",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-01-29T12:45:00Z"
      },
      {
        "version": "1.0.0.8",
        "changelog": "Fixed Jellyfin 10.11.6 streaming compatibility with HTTP Range request support. Added proper stream proxying with unbuffered streaming, range request handling (206 Partial Content), and improved header forwarding for FFmpeg compatibility.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.8/jfresolve.zip",
        "checksum": "b1da5594029c3f3b399565561bbf3171",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-01-29T12:30:00Z"
      },
      {
        "version": "1.0.0.7",
        "changelog": "Fixed Jellyfin 10.11.6 streaming compatibility by proxying streams instead of redirecting. Removed forced transcoding - now lets Jellyfin decide transcoding based on codec compatibility and client capabilities.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.7/jfresolve.zip",
        "checksum": "ca6769610706f5b671d0e2dac345a096",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-01-29T12:00:00Z"
      },
      {
        "version": "1.0.0.6",
        "changelog": "Fixed compatibility issues with Jellyfin 10.11.6. Updated MediaSourceManagerDecorator to use compatible method signatures.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.6/jfresolve.zip",
        "checksum": "f949b2053ef3029bb5e1b8ebe206b254",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-01-29T10:36:00Z"
      },
      {
        "version": "1.0.0.5",
        "changelog": "Added failover system for dead links with configurable time windows. Code cleanup and optimization. Improved quality version support with individual stream probing.",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.5/jfresolve.zip",
        "checksum": "cd720cb021de832e50e81b374e22b79f",
        "targetAbi": "10.11.0.0",
        "timestamp": "2026-01-01T12:00:00Z"
      },
      {
        "version": "1.0.0.4",
        "changelog": "Added new classifications for auto populate. Thanks to @Ajayrajasekaran",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.4/jfresolve.zip",
        "checksum": "9d4d9a951ad42118988e950a8679907c",
        "targetAbi": "10.11.0.0",
        "timestamp": "2025-12-02T12:10:00Z"
      },
      {
        "version": "1.0.0.3",
        "changelog": "Code overhaul, new methods for search, save and auto populate, new instructions",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.3/jfresolve.zip",
        "checksum": "4b765a9ad511eadc2253cf8bc8e823f2",
        "targetAbi": "10.11.0.0",
        "timestamp": "2025-11-18T12:10:00Z"
      },
      {
        "version": "1.0.0.2",
        "changelog": "Targeted library refresh after search added",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.2/jfresolve.zip",
        "checksum": "4d11fc08cee441a4b94e2c34c0c1e992",
        "targetAbi": "10.11.0.0",
        "timestamp": "2025-11-07T12:10:00Z"
      },
      {
        "version": "1.0.0.1",
        "changelog": "Library refresh after search added",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.1/jfresolve.zip",
        "checksum": "4386fe0123ca8addc2f98c4f21dd44b6",
        "targetAbi": "10.11.0.0",
        "timestamp": "2025-11-07T12:04:00Z"
      },
      {
        "version": "1.0.0.0",
        "changelog": "Jfresolve plugin for jellyfin version 10.11.x.x - Added configurable library population scheduling, fixed plugin disposal on uninstall, improved version segmentation",
        "sourceUrl": "https://github.com/dennisstorm-hass/jfresolve/releases/download/10.11.1.0.0.0/jfresolve.zip",
        "checksum": "d010683d6c50db1c4e4f86f5198f5ec1",
        "targetAbi": "10.11.0.0",
        "timestamp": "2025-11-04T12:04:00Z"
      }
    ]
  }
]
